//================================================
//
//制作実践基礎[bullet.cpp]
//Author:Kishimoto Eiji
//
//================================================
//***************************
//インクルード
//***************************
#include "bullet.h"
#include "application.h"
#include "renderer.h"

#include <assert.h>

//================================================
//生成
//================================================
CBullet* CBullet::Create()
{
	CBullet* pBullet = nullptr;	//ポインタ

	if (pBullet != nullptr)
	{//NULLチェック
		assert(false);
	}

	/* nullptrの場合 */

	pBullet = new CBullet;	//メモリの動的確保

	pBullet->Init();	//初期化

	return pBullet;	//動的確保したものを返す
}

//================================================
//コンストラクタ
//================================================
CBullet::CBullet()
{
}

//================================================
//デストラクタ
//================================================
CBullet::~CBullet()
{
}

//================================================
//初期化
//================================================
HRESULT CBullet::Init()
{
	CObject2D::Init();	//親クラス

	//位置を設定
	D3DXVECTOR3 pos = D3DXVECTOR3((CRenderer::SCREEN_WIDTH * 0.8f), (CRenderer::SCREEN_HEIGHT * 0.5f), 0.0f);
	CObject2D::SetPos(pos);

	return S_OK;
}

//================================================
//終了
//================================================
void CBullet::Uninit()
{
	CObject2D::Uninit();	//親クラス
}

//================================================
//更新
//================================================
void CBullet::Update()
{
	CObject2D::Update();	//親クラス
}

//================================================
//描画
//================================================
void CBullet::Draw()
{
	CObject2D::Draw();	//親クラス
}