//================================================
//
//制作実践基礎[object.cpp]
//Author:Kishimoto Eiji
//
//================================================
//***************************
//インクルード
//***************************
#include "object.h"
#include "renderer.h"

//================================================
//コンストラクタ
//================================================
CObject::CObject()
{
	//メンバ変数のクリア
	m_pTexture = nullptr;
	m_pVtxBuff = nullptr;
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_fLength = 0.0f;
	m_fAngle = 0.0f;
	m_fSize = 0.0f;
	m_fCol = 0.0f;
}

//================================================
//デストラクタ
//================================================
CObject::~CObject()
{
	/* 処理無し */
}